package spider;

import org.apache.commons.io.FileUtils;

import java.io.*;
import java.util.*;

public class test {
    public static void main(String[] args) throws IOException {
        test();
    }
    public static void forPictures() throws IOException {
        List<String> line = FileUtils.readLines(new File("E:\\www\\Spider\\空调.txt"), "utf-8");
        String[] arr = line.toArray(new String[0]);
        String o = arr[(int) Math.floor(Math.random() * arr.length)];
        System.out.println("随机图片：" + o);

    }
    public static void test() {
        StringBuilder str=new StringBuilder("<p>法国留学具体费用</p><p><img src=\"http://www.wdtkd.com/uploads/pictures/1-1P32Q045360-L.jpg\" height=\"500\" width=\"580\" /></p><p>　　澳际小编知道很多学生在法国留学相关的具体费用问题，在法国留学有一个问题，下面小编整理了“[法国]留学法国的具体费用，研究多少钱？“Q＆A相关的内容，欢迎。如有疑问，请联系我们的在线的老师，专业的一对一的Q＆A。我希望同学们能出国留学成功！</p><p>　　法国免学费的公立大学，学生只需要注册约80-500欧元的年度成本。而国外的学生和他们的学生，可享受住房，医疗，保险，交通等诸多补贴，这使得在法国留学的大大提高了成本。多少钱你在法国留学？</p><p>　　1，去了法国在前期成本研究</p><p>　　报名费：1200元；</p><p>　　语言培训：6000？8000元；</p><p>　　语言测试报名费：800/1000元；</p><p>　　使馆语言评估费：1500元；</p><p>银行存款证明：60，000至80，000元；</p><p>门票：5000？6000元。</p><p>　　公证费，护照费，签证费，体检费等。1000-2000元。</p><p>　　2，学费（注册费）</p><p>　　法国的公立大学，免费教育的实施，只要学生上学在法国，与高中毕业考试成绩，可免试入学。</p><p>　　大学注册费将根据自己的选择，当然是每年约300欧元。私人工程学校，企业或管理的学费大约是4000？15000欧元。</p><p>　　例如，酒店管理的华Daile学校，将花费7-9万元，每年人民[法国]留学法国的具体费用，研究多少钱？币左右（包括学费，生活费），应该说，一些法国私立大学学费相对昂贵。</p><p>　　由于不同性质的学校和高低不等的教育开支：</p><p>　　大学注册费为每年120至700欧元</p><p>　　平均从每年高等专科学校40015000欧元</p><p>　　其他类型的从300到6000日欧元机构每年不</p><p>　　特别值得注意的是：中国学生去法国的第一年，研究经常需要看的语言学校或预科班，这些学校一般700欧元之间花费6000欧元，按照数量和教训成本，每节课设置，每类8至10欧元。</p><p>　　3，生活成本</p><p>　　（1）租</p><p>　　关于房租，文章曾提到前。分为不同类型的房间，也有不同的价格。更便宜的租金价格，大约90-150欧元。当然，这是后CAF去除住房补贴的费用。如果，在巴黎，可能需要一个单间300欧元更昂贵。</p><p>　　1）大部分由政府建造的法国学校宿舍的，成本低，条件会比较差。之间每月120-200欧元，之后除去约75欧元的住房补贴/月（省）。</p><p>　　2）民营企业和民营营利性高校学生的宿舍建设成本适中，可以申请住房补贴，约150欧元/月后补助，条件较好（省）。</p><p>　　3）青年公寓，房子大，适中的租金补贴后，大约180欧元（省）。</p><p>　　4）法国人留下来，租私人住房，可以申请住房补贴，这取决于房子可能。</p><p>　　5）长住酒店和宾馆，更昂贵，有的不能申请房屋补助。在法国，[法国]留学法国的具体费用，研究多少钱？在校大学生有简单的家具宿舍，有些地方包括水电费和供暖费，有的不包。学生可以在法国申请30％-60％的学生每月住房补贴的。</p><p>　　型公寓，有独立的卫生间和厨房和卧室，我们把它叫做工作室。巴黎的住宿会比其他一些地区的价格较贵，大概500-800欧洲。该价格是根据城市从市中心到可用性的位置和大小（CAF法国政府将提供补助范围从90-230欧元）。</p><p>　　法[法国]留学法国的具体费用，研究多少钱？国学校为学生提供外国学生的住宿，但这样的资讯通常狭小，成本是每月110-150欧元。对外国学生在法国留学的住宿更常见的形式是校外公寓，一层浴室的公寓需要每月租金400-600欧元在巴黎，这是否是在该领域更便宜，每月200-350欧元。</p><p>　　（2）膳食</p><p>　　法国大学食堂，然后每餐花费大约3欧元。通常你可以去超市买便宜菜，做饭，然后经常吃，更省钱。</p><p>　　（3）医疗保险</p><p>　　在学习法律的学生必须支付医疗保险费。根据学生和保险的年龄层次，年缴保费约为180欧元。长期保险合同为一年，但必须一次每学年购买。在这种保险，当你去法国大学入学率，你可以咨询学校。他们将提出建议，如SMENO。</p><p>　　（4）交通费</p><p>　　如果您经常乘坐公共汽车或地铁，你可以申请月票，可能是几十欧元。学生超值优惠。</p><p>　　大多数用户曾经通过搜索：在法国的研究中，法国学生在法国和相关的关键字等具体成本研究来达到这一页，论文“[法国]留学法国的具体费用，研究多少钱？“从互联网的内容并不代表我们的观点，如果我们转载稿件涉及您的版权，请发送电子邮件至liyanjun @奥吉。CN，我们将在第一时间本网站将妥善按照国家法律法规尽快处理尽可能。</p>");
        LinkedList<Integer> list=new LinkedList<Integer>();
        list.add(-1);
        String hhh="在下萝莉控";
           while (true){
               boolean a=true;
               int index = str.indexOf("<p>",(int)Math.floor(Math.random()*str.length()));
               if (index==-1)continue;
               for (Integer integer : list) if (index == integer)  a = false;
               if (a){
                   str.insert(index+3,hhh);
                   list.add(index);
               }
               if (list.size()>3)break;
           }
        list.remove(0);
        System.out.println(list);
        String ssss = new String(str);
        System.out.println("插入关键字后的文本：" + ssss);
    }
}
